NordicSemiconductor/nrfx/mdk/nrf54lm20a_enga_application_peripherals.h
#define SPIM24_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */
#define SPIM24_MAX_DATARATE 8                        /*!< (unspecified)                                                        */
#define SPIM24_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define SPIM24_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define SPIM24_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define SPIM24_FEATURE_HARDWARE_CSN_PRESENT 1        /*!< (unspecified)                                                        */
#define SPIM24_FEATURE_HARDWARE_DCX_PRESENT 0        /*!< (unspecified)                                                        */
#define SPIM24_FEATURE_RXDELAY_PRESENT 1             /*!< (unspecified)                                                        */
#define SPIM24_STALL_STATUS_PRESENT 0                /*!< (unspecified)                                                        */
#define SPIM24_STALL_STATUS_TX_PRESENT 0             /*!< (unspecified)                                                        */
#define SPIM24_NUM_CHIPSELECT_MIN 0                  /*!< (unspecified)                                                        */
#define SPIM24_NUM_CHIPSELECT_MAX 0                  /*!< (unspecified)                                                        */
#define SPIM24_NUM_CHIPSELECT_SIZE 1                 /*!< (unspecified)                                                        */
#define SPIM24_CORE_FREQUENCY 16                     /*!< Peripheral core frequency is 16 MHz.                                 */
#define SPIM24_PRESCALER_PRESENT 1                   /*!< (unspecified)                                                        */
#define SPIM24_PRESCALER_DIVISOR_RANGE_MIN 2         /*!< (unspecified)                                                        */
#define SPIM24_PRESCALER_DIVISOR_RANGE_MAX 126       /*!< (unspecified)                                                        */
#define SPIM24_PRESCALER_DIVISOR_RANGE_SIZE 127      /*!< (unspecified)                                                        */
#define SPIM24_RXDELAY_VALUE_RANGE_MIN 0             /*!< (unspecified)                                                        */
#define SPIM24_RXDELAY_VALUE_RANGE_MAX 7             /*!< (unspecified)                                                        */
#define SPIM24_RXDELAY_VALUE_RANGE_SIZE 8            /*!< (unspecified)                                                        */
#define SPIM24_RXDELAY_RESET_VALUE 1                 /*!< (unspecified)                                                        */
#define SPIM24_RXDELAY_FIELD_WIDTH_MIN 0             /*!< (unspecified)                                                        */
#define SPIM24_RXDELAY_FIELD_WIDTH_MAX 2             /*!< (unspecified)                                                        */
#define SPIM24_RXDELAY_FIELD_WIDTH_SIZE 3            /*!< (unspecified)                                                        */

#define SPIM30_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                   */
#define SPIM30_MAX_DATARATE 8                        /*!< (unspecified)                                                        */
#define SPIM30_EASYDMA_MAXCNT_MIN 0                  /*!< (unspecified)                                                        */
#define SPIM30_EASYDMA_MAXCNT_MAX 15                 /*!< (unspecified)                                                        */
#define SPIM30_EASYDMA_MAXCNT_SIZE 16                /*!< (unspecified)                                                        */
#define SPIM30_FEATURE_HARDWARE_CSN_PRESENT 1        /*!< (unspecified)                                                        */
#define SPIM30_FEATURE_HARDWARE_DCX_PRESENT 0        /*!< (unspecified)                                                        */
#define SPIM30_FEATURE_RXDELAY_PRESENT 1             /*!< (unspecified)                                                        */
#define SPIM30_STALL_STATUS_PRESENT 0                /*!< (unspecified)                                                        */
#define SPIM30_STALL_STATUS_TX_PRESENT 0             /*!< (unspecified)                                                        */
#define SPIM30_NUM_CHIPSELECT_MIN 0                  /*!< (unspecified)                                                        */
#define SPIM30_NUM_CHIPSELECT_MAX 0                  /*!< (unspecified)                                                        */
#define SPIM30_NUM_CHIPSELECT_SIZE 1                 /*!< (unspecified)                                                        */
#define SPIM30_CORE_FREQUENCY 16                     /*!< Peripheral core frequency is 16 MHz.                                 */
#define SPIM30_PRESCALER_PRESENT 1                   /*!< (unspecified)                                                        */
#define SPIM30_PRESCALER_DIVISOR_RANGE_MIN 2         /*!< (unspecified)                                                        */
#define SPIM30_PRESCALER_DIVISOR_RANGE_MAX 126       /*!< (unspecified)                                                        */
#define SPIM30_PRESCALER_DIVISOR_RANGE_SIZE 127      /*!< (unspecified)                                                        */
#define SPIM30_RXDELAY_VALUE_RANGE_MIN 0             /*!< (unspecified)                                                        */
#define SPIM30_RXDELAY_VALUE_RANGE_MAX 7             /*!< (unspecified)                                                        */
#define SPIM30_RXDELAY_VALUE_RANGE_SIZE 8            /*!< (unspecified)                                                        */
#define SPIM30_RXDELAY_RESET_VALUE 1                 /*!< (unspecified)                                                        */
#define SPIM30_RXDELAY_FIELD_WIDTH_MIN 0             /*!< (unspecified)                                                        */
#define SPIM30_RXDELAY_FIELD_WIDTH_MAX 2             /*!< (unspecified)                                                        */
#define SPIM30_RXDELAY_FIELD_WIDTH_SIZE 3            /*!< (unspecified)                                                        */

