NordicSemiconductor/nrfx/mdk/nrf54lm20a_enga_application_peripherals.h
#define UARTE23_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define UARTE23_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define UARTE23_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define UARTE23_TIMEOUT_INTERRUPT 1                  /*!< (unspecified)                                                        */
#define UARTE23_CONFIGURABLE_DATA_FRAME_SIZE 1       /*!< (unspecified)                                                        */
#define UARTE23_CORE_FREQUENCY 16                    /*!< Peripheral clock frequency is 16 MHz.                                */
#define UARTE23_CORE_CLOCK_16 1                      /*!< (unspecified)                                                        */
#define UARTE23_SHORTS_ENDTX_STOPTX 1                /*!< (unspecified)                                                        */
#define UARTE23_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */

#define UARTE24_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define UARTE24_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define UARTE24_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define UARTE24_TIMEOUT_INTERRUPT 1                  /*!< (unspecified)                                                        */
#define UARTE24_CONFIGURABLE_DATA_FRAME_SIZE 1       /*!< (unspecified)                                                        */
#define UARTE24_CORE_FREQUENCY 16                    /*!< Peripheral clock frequency is 16 MHz.                                */
#define UARTE24_CORE_CLOCK_16 1                      /*!< (unspecified)                                                        */
#define UARTE24_SHORTS_ENDTX_STOPTX 1                /*!< (unspecified)                                                        */
#define UARTE24_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */

#define UARTE30_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define UARTE30_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define UARTE30_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define UARTE30_TIMEOUT_INTERRUPT 1                  /*!< (unspecified)                                                        */
#define UARTE30_CONFIGURABLE_DATA_FRAME_SIZE 1       /*!< (unspecified)                                                        */
#define UARTE30_CORE_FREQUENCY 16                    /*!< Peripheral clock frequency is 16 MHz.                                */
#define UARTE30_CORE_CLOCK_16 1                      /*!< (unspecified)                                                        */
#define UARTE30_SHORTS_ENDTX_STOPTX 1                /*!< (unspecified)                                                        */
#define UARTE30_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */

/*Voltage glitch detectors*/
#define GLITCHDET_PRESENT 1
#define GLITCHDET_COUNT 1

/*RRAM controller GLITCH detector*/
#define RRAMC_PRESENT 1
#define RRAMC_COUNT 1

#define RRAMC_NRRAMWORDSIZE 128                      /*!< RRAM word size : 128 bits per wordline                               */
#define RRAMC_NWRITEBUFSIZE 32                       /*!< Maximum write buffer size : 32                                       */
#define RRAMC_REGION0ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION0SIZE 4                          /*!< (unspecified)                                                        */
#define RRAMC_REGION0SIZE_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION0READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION0READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION0EXECUTE 0                       /*!< (unspecified)                                                        */
#define RRAMC_REGION0EXECUTE_WRITABLE 0              /*!< (unspecified)                                                        */
#define RRAMC_REGION0SECURE 0                        /*!< (unspecified)                                                        */
#define RRAMC_REGION0SECURE_WRITABLE 0               /*!< (unspecified)                                                        */
#define RRAMC_REGION0OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION0OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITEONCE 1                     /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITEONCE_WRITABLE 0            /*!< (unspecified)                                                        */
#define RRAMC_REGION0LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION0LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1SIZE 4                          /*!< (unspecified)                                                        */
#define RRAMC_REGION1SIZE_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION1READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION1EXECUTE 0                       /*!< (unspecified)                                                        */
#define RRAMC_REGION1EXECUTE_WRITABLE 0              /*!< (unspecified)                                                        */
#define RRAMC_REGION1SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION1SECURE_WRITABLE 1               /*!< (unspecified)                                                        */
#define RRAMC_REGION1OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION1OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITEONCE 1                     /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITEONCE_WRITABLE 0            /*!< (unspecified)                                                        */
#define RRAMC_REGION1LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION1LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2SIZE 8                          /*!< (unspecified)                                                        */
#define RRAMC_REGION2SIZE_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION2READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION2EXECUTE 0                       /*!< (unspecified)                                                        */
#define RRAMC_REGION2EXECUTE_WRITABLE 0              /*!< (unspecified)                                                        */
#define RRAMC_REGION2SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION2SECURE_WRITABLE 0               /*!< (unspecified)                                                        */
#define RRAMC_REGION2OWNER 2                         /*!< (unspecified)                                                        */
#define RRAMC_REGION2OWNER_WRITABLE 0                /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITEONCE 0                     /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITEONCE_WRITABLE 1            /*!< (unspecified)                                                        */
#define RRAMC_REGION2LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION2LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3SIZE 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION3SIZE_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION3READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION3EXECUTE 1                       /*!< (unspecified)                                                        */
#define RRAMC_REGION3EXECUTE_WRITABLE 1              /*!< (unspecified)                                                        */
#define RRAMC_REGION3SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION3SECURE_WRITABLE 1               /*!< (unspecified)                                                        */
#define RRAMC_REGION3OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION3OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITEONCE 0                     /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITEONCE_WRITABLE 1            /*!< (unspecified)                                                        */
#define RRAMC_REGION3LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION3LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4ADDR_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4SIZE 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION4SIZE_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION4READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION4EXECUTE 1                       /*!< (unspecified)                                                        */
#define RRAMC_REGION4EXECUTE_WRITABLE 1              /*!< (unspecified)                                                        */
#define RRAMC_REGION4SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION4SECURE_WRITABLE 1               /*!< (unspecified)                                                        */
#define RRAMC_REGION4OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION4OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITEONCE 0                     /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITEONCE_WRITABLE 1            /*!< (unspecified)                                                        */
#define RRAMC_REGION4LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION4LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_GLITCHDETECTORS 0                      /*!< (unspecified)                                                        */

/*GPIO Port*/
#define GPIO_PRESENT 1
#define GPIO_COUNT 4

#define P2_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P2_CTRLSEL_MAP2 1                            /*!< (unspecified)                                                        */
#define P2_CTRLSEL_MAP3 0                            /*!< (unspecified)                                                        */
#define P2_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P2_PIN_NUM_MAX 10                            /*!< (unspecified)                                                        */
#define P2_PIN_NUM_SIZE 11                           /*!< (unspecified)                                                        */
#define P2_FEATURE_PINS_PRESENT 2047                 /*!< (unspecified)                                                        */
#define P2_PIN_SENSE_MECHANISM 0                     /*!< (unspecified)                                                        */
#define P2_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P2_RETAIN 0                                  /*!< (unspecified)                                                        */
#define P2_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P2_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P2_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P1_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P1_CTRLSEL_MAP2 1                            /*!< (unspecified)                                                        */
#define P1_CTRLSEL_MAP3 0                            /*!< (unspecified)                                                        */
#define P1_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P1_PIN_NUM_MAX 31                            /*!< (unspecified)                                                        */
#define P1_PIN_NUM_SIZE 32                           /*!< (unspecified)                                                        */
#define P1_FEATURE_PINS_PRESENT 4294967295           /*!< (unspecified)                                                        */
#define P1_PIN_SENSE_MECHANISM 1                     /*!< (unspecified)                                                        */
#define P1_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P1_RETAIN 0                                  /*!< (unspecified)                                                        */
#define P1_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P1_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P1_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P3_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P3_CTRLSEL_MAP2 1                            /*!< (unspecified)                                                        */
#define P3_CTRLSEL_MAP3 0                            /*!< (unspecified)                                                        */
#define P3_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P3_PIN_NUM_MAX 12                            /*!< (unspecified)                                                        */
#define P3_PIN_NUM_SIZE 13                           /*!< (unspecified)                                                        */
#define P3_FEATURE_PINS_PRESENT 8191                 /*!< (unspecified)                                                        */
#define P3_PIN_SENSE_MECHANISM 1                     /*!< (unspecified)                                                        */
#define P3_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P3_RETAIN 0                                  /*!< (unspecified)                                                        */
#define P3_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P3_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P3_BIASCTRL 0                                /*!< (unspecified)                                                        */

